{
  "intents": [
    {
      "tag": "RGB",
      "patterns": [
        "What is Rwanda Governance Board?",
        "Tell me about Rwanda Governance Board",
        "What does Rwanda Governance Board do?"
      ],
      "responses": [
        "Rwanda Governance Board (RGB) is an independent public institution responsible for ensuring good governance practices in the public and private sector in Rwanda. Its aim is to promote integrity, transparency, accountability, and the rule of law."
      ]
    },
    {
      "tag": "RGB Vision",
      "patterns": [
        "What is the vision of Rwanda Governance Board?",
        "Tell me about the vision of Rwanda Governance Board"
      ],
      "responses": [
        "The vision of Rwanda Governance Board is to be a leading institution in promoting good governance practices in Rwanda."
      ]
    },
    {
      "tag": "RGB Mission",
      "patterns": [
        "What is the mission of Rwanda Governance Board?",
        "Tell me about the mission of Rwanda Governance Board"
      ],
      "responses": [
        "The mission of Rwanda Governance Board is to promote integrity, transparency, accountability and the rule of law in the public and private sector, in order to contribute to sustainable development in Rwanda."
      ]
    },
    {
      "tag": "RGB Mandate",
      "patterns": [
        "What is the mandate of Rwanda Governance Board?",
        "Tell me about the mandate of Rwanda Governance Board"
      ],
      "responses": [
        "The mandate of Rwanda Governance Board is to ensure good governance practices in the public and private sector, and to promote integrity, transparency, accountability, and the rule of law."
      ]
    },
    {
      "tag": "Board Members",
      "patterns": [
        "Who are the members of RGB?",
        "Can you tell me the names of the members of the Rwanda Governance Board?",
        "What are the names of the people on RGB board?"
      ],
      "responses": [
        "The members of Rwanda Governance Board (RGB) are: 1. Jean Pierre Karabaranga (Chairperson), 2. Francoise Mukankusi, 3. Jean Bosco Mutangana, 4. Godfrey Musoni, 5. Rose Rwabuhihi, 6. Anastase Shyaka and 7. Ezechias Nkurunziza."
      ]
    },
    {
      "tag": "Mission",
      "patterns": [
        "What is the mission of RGB?",
        "What is the purpose of Rwanda Governance Board?",
        "Can you explain the mission of the Rwanda Governance Board?"
      ],
      "responses": [
        "The mission of Rwanda Governance Board (RGB) is to enhance the quality of governance in Rwanda by promoting ethics, accountability, transparency, and integrity in the public and private sectors."
      ]
    },
    {
      "tag": "Values",
      "patterns": [
        "What are the values of RGB?",
        "Can you tell me the values of Rwanda Governance Board?",
        "What are the guiding principles of RGB?"
      ],
      "responses": [
        "The values of Rwanda Governance Board (RGB) are: ethics, accountability, transparency, and integrity."
      ]
    },
    {
      "tag": "Vision",
      "patterns": [
        "What is the vision of RGB?",
        "Can you explain the vision of Rwanda Governance Board?",
        "What is the future goal of RGB?"
      ],
      "responses": [
        "The vision of Rwanda Governance Board (RGB) is to be a leader in promoting good governance practices and a reference in the fight against corruption in Rwanda and the region."
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "Hi there"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! What can I help you with?",
        "Good [time of day], how can I help you?"
      ]
    }
  ]
}
